## pandas 
- Series

## matplotlib

In [1]:
import pandas as pd

In [29]:
# how to create Series Array and Print the values
internal1 = {"s1":40, "s2":50, "s3":30}

In [30]:
internal1

{'s1': 40, 's2': 50, 's3': 30}

In [31]:
s = pd.Series(internal1)

In [6]:
#Displaying series array 
s

s1    40
s2    50
s3    30
dtype: int64

In [7]:
s[1]

50

In [8]:
s[:3]

s1    40
s2    50
s3    30
dtype: int64

In [9]:
s[1:3]

s2    50
s3    30
dtype: int64

In [10]:
s[0] = 60

In [23]:
l = [[1,2,3,4,5],[6,7,8,9,10]]
#create a DataFrame
d = pd.DataFrame(l)
print(d)
sum(d)

   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10

10

In [11]:
s[0]

60

In [12]:
s

s1    60
s2    50
s3    30
dtype: int64

In [13]:
l = [1,2,3,4,5]
s = pd.Series(l)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [14]:
s[0] = 44

In [15]:
sum(s)

58

In [25]:
sum(d[1]) # sum up the entire col based on index

9

In [26]:
for i in d.values:
    for j in i:
        print(j)

1
2
3
4
5
6
7
8
9
10

In [27]:
d

   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10

In [28]:
d[4]

0     5
1    10
Name: 4, dtype: int64

In [58]:
internal2 = {"s1":100, "s2":40, "s3":60}

In [59]:
s_internal1 = pd.Series(internal1)
s_internal2 = pd.Series(internal2)
s_internal1
s_internal2

s1    100
s2     40
s3     60
dtype: int64

In [60]:
two = {'Internal_1':s_internal1, 'Internal_2':s_internal2}

In [61]:
two

{'Internal_1': s1    40
 s2    50
 s3    30
 dtype: int64, 'Internal_2': s1    100
 s2     40
 s3     60
 dtype: int64}

In [62]:
data_internals = pd.DataFrame(two)

In [63]:
data_internals[Internal_2]

NameError: name 'Internal_2' is not defined

In [53]:
data_internals[Internal_1]

NameError: name 'Internal_1' is not defined

In [64]:
l = []
for i in data_internals.values:
    print(sum(i)/2)

70.0
45.0
45.0

In [65]:
data_internals

    Internal_1  Internal_2
s1          40         100
s2          50          40
s3          30          60

In [66]:
l = []
for i in data_internals.values:
    s=0
    for j in i:
        s+=j
    print(s)

140
90
90

In [68]:
data_internals

    Internal_1  Internal_2
s1          40         100
s2          50          40
s3          30          60

In [69]:
        data_internals['four']=data_internals['Internal_1']+data_internals['Internal_2']

In [70]:
data_internals

    Internal_1  Internal_2  four
s1          40         100   140
s2          50          40    90
s3          30          60    90

In [71]:
del(data_internals['four'])

In [72]:
data_internals

    Internal_1  Internal_2
s1          40         100
s2          50          40
s3          30          60

In [73]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
d

{'one': a    1
 b    2
 c    3
 dtype: int64, 'two': a    1
 b    2
 c    3
 d    4
 dtype: int64}

In [75]:
data_internals.loc['s3'] = [11,22]

In [76]:
data_internals

    Internal_1  Internal_2
s1          40         100
s2          50          40
s3          11          22

In [77]:
data_internals.loc['s4'] = [12,52]

In [78]:
data_internals

    Internal_1  Internal_2
s1          40         100
s2          50          40
s3          11          22
s4          12          52

In [80]:
print(data_internals[:3])

    Internal_1  Internal_2
s1          40         100
s2          50          40
s3          11          22

In [81]:
df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])

In [82]:
df

   a  b
0  1  2
1  3  4

In [85]:
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

In [86]:
df2

   a  b
0  5  6
1  7  8

In [87]:
df.append(df2)

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [88]:
df.drop(0)

   a  b
1  3  4

In [89]:
df

   a  b
0  1  2
1  3  4

In [90]:
df2

   a  b
0  5  6
1  7  8

In [91]:
df3 = df.append(df2)

In [93]:
df3.drop(0)

   a  b
1  3  4
1  7  8

In [94]:
data_internals

    Internal_1  Internal_2
s1          40         100
s2          50          40
s3          11          22
s4          12          52

In [95]:
l=[]
for i in data_internals.values:
    s = sum(i)
    l.append(s/2)
data_internals['Avg'] = l

In [96]:
data_internals

    Internal_1  Internal_2   Avg
s1          40         100  70.0
s2          50          40  45.0
s3          11          22  16.5
s4          12          52  32.0

In [97]:
di = data_internals
del(di['Avg'])

In [98]:
di

    Internal_1  Internal_2
s1          40         100
s2          50          40
s3          11          22
s4          12          52